Tekla Open API Reference for Tekla Structures 2025
PluginBase.InputDefinition Constructor (ArrayList)
 Creates a new input definition instance with multiple point or identifier instances.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public InputDefinition(
	ArrayList _Input
)
Public Sub New (
	_Input As ArrayList
)
Parameters
_Input
Type: System.Collections.ArrayList
A list of either points or identifiers.
See Also
Reference
PluginBase.InputDefinition Class
PluginBase.InputDefinition Overload
Tekla.Structures.Plugins Namespace